`PVD 28-12-2020`

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                    'key2' : ['one', 'two', 'one', 'two', 'one'],
                    'data1' : np.random.randn(5),
                    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.199620  0.188289
1    a  two -0.141585 -0.947733
2    b  one  0.108369  0.987683
3    b  two -0.989682 -0.517679
4    a  one -0.463463 -1.077848

In [5]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [6]:
grouped.mean()

key1
a   -0.268222
b   -0.440657
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.331541
      two    -0.141585
b     one     0.108369
      two    -0.989682
Name: data1, dtype: float64

In [9]:
 means.unstack()

key2       one       two
key1
a    -0.331541 -0.141585
b     0.108369 -0.989682

In [11]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.141585
            2006    0.108369
Ohio        2005   -0.594651
            2006   -0.463463
Name: data1, dtype: float64

In [13]:
 df.groupby('key1').mean()

         data1     data2
key1
a    -0.268222 -0.612430
b    -0.440657  0.235002

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.331541 -0.444779
     two  -0.141585 -0.947733
b    one   0.108369  0.987683
     two  -0.989682 -0.517679

In [15]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

#### Iterating Over Groups

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.199620  0.188289
1    a  two -0.141585 -0.947733
4    a  one -0.463463 -1.077848
b
  key1 key2     data1     data2
2    b  one  0.108369  0.987683
3    b  two -0.989682 -0.517679

In [18]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
        print((k1, k2))
        print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.199620  0.188289
4    a  one -0.463463 -1.077848
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.141585 -0.947733
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.108369  0.987683
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.989682 -0.517679

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.108369  0.987683
3    b  two -0.989682 -0.517679

In [23]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [26]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.199620  0.188289
1 -0.141585 -0.947733
2  0.108369  0.987683
3 -0.989682 -0.517679
4 -0.463463 -1.077848
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [29]:
data = {"Team": ["Red Sox", "Red Sox", "Red Sox", "Red Sox", "Red Sox", "Red Sox", "Yankees", "Yankees", "Yankees", "Yankees", "Yankees", "Yankees"],

    "Pos": ["Pitcher", "Pitcher", "Pitcher", "Not Pitcher", "Not Pitcher", "Not Pitcher", "Pitcher", "Pitcher", "Pitcher", "Not Pitcher", "Not Pitcher", "Not Pitcher"],

    "Age": [24, 28, 40, 22, 29, 33, 31, 26, 21, 36, 25, 31]}

df = pd.DataFrame(data)
print(df)

       Team          Pos  Age
0   Red Sox      Pitcher   24
1   Red Sox      Pitcher   28
2   Red Sox      Pitcher   40
3   Red Sox  Not Pitcher   22
4   Red Sox  Not Pitcher   29
5   Red Sox  Not Pitcher   33
6   Yankees      Pitcher   31
7   Yankees      Pitcher   26
8   Yankees      Pitcher   21
9   Yankees  Not Pitcher   36
10  Yankees  Not Pitcher   25
11  Yankees  Not Pitcher   31

In [51]:
df.groupby('Pos').mean()

                   Age
Pos
Not Pitcher  29.333333
Pitcher      28.333333

In [60]:
df.groupby('Pos').size()

Pos
Not Pitcher    6
Pitcher        6
dtype: int64

In [47]:
df['Age'].groupby(df['Pos']).mean()

Pos
Not Pitcher    29.333333
Pitcher        28.333333
Name: Age, dtype: float64

In [58]:
df.groupby('Team').size()

Team
Red Sox    6
Yankees    6
dtype: int64

In [59]:
df.groupby('Team').mean()

               Age
Team
Red Sox  29.333333
Yankees  28.333333

In [72]:
for name, group in df.groupby('Pos'):
    print(name)
    print(group)

Not Pitcher
       Team          Pos  Age
3   Red Sox  Not Pitcher   22
4   Red Sox  Not Pitcher   29
5   Red Sox  Not Pitcher   33
9   Yankees  Not Pitcher   36
10  Yankees  Not Pitcher   25
11  Yankees  Not Pitcher   31
Pitcher
      Team      Pos  Age
0  Red Sox  Pitcher   24
1  Red Sox  Pitcher   28
2  Red Sox  Pitcher   40
6  Yankees  Pitcher   31
7  Yankees  Pitcher   26
8  Yankees  Pitcher   21

In [73]:
for name, group in df.groupby('Team'):
    print(name)
    print(group)

Red Sox
      Team          Pos  Age
0  Red Sox      Pitcher   24
1  Red Sox      Pitcher   28
2  Red Sox      Pitcher   40
3  Red Sox  Not Pitcher   22
4  Red Sox  Not Pitcher   29
5  Red Sox  Not Pitcher   33
Yankees
       Team          Pos  Age
6   Yankees      Pitcher   31
7   Yankees      Pitcher   26
8   Yankees      Pitcher   21
9   Yankees  Not Pitcher   36
10  Yankees  Not Pitcher   25
11  Yankees  Not Pitcher   31

In [83]:
for name, group in df.groupby(['Age', 'Team']):
    print(name)

(21, 'Yankees')
(22, 'Red Sox')
(24, 'Red Sox')
(25, 'Yankees')
(26, 'Yankees')
(28, 'Red Sox')
(29, 'Red Sox')
(31, 'Yankees')
(33, 'Red Sox')
(36, 'Yankees')
(40, 'Red Sox')

In [90]:
df.groupby(['Team', 'Pos','Age']).size()

Team     Pos          Age
Red Sox  Not Pitcher  22     1
                      29     1
                      33     1
         Pitcher      24     1
                      28     1
                      40     1
Yankees  Not Pitcher  25     1
                      31     1
                      36     1
         Pitcher      21     1
                      26     1
                      31     1
dtype: int64